Masmiseim36/nxpSDK/boards/twrkv46f150m/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.c
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v5.0
processor: MKV46F256xxx16
package_id: MKV46F256VLL16
mcu_data: ksdk2_0
processor_version: 5.0.0
board: TWR-KV46F150M
pin_labels:
- {pin_num: '38', pin_signal: PTA4/LLWU_P3/FTM0_CH1/XBARIN10/FTM0_FLT3/FlexPWM_B0/NMI_b, label: 'J503[3]/J18[9]/GA4', identifier: TMR_2}
- {pin_num: '44', pin_signal: CMP3_IN0/PTA14/SPI0_PCS0/UART0_TX, label: 'J500[B46]/J502[16]/GPIOA14/SPI_CS0', identifier: SPI_CS}
- {pin_num: '45', pin_signal: CMP3_IN1/PTA15/SPI0_SCK/UART0_RX, label: 'J500[B48]/J502[20]/GPIOA15/SPI_SCK', identifier: SPI_SCK}
- {pin_num: '46', pin_signal: CMP3_IN2/PTA16/SPI0_SOUT/UART0_CTS_b/UART0_COL_b, label: 'J500[B45]/J502[22]/GPIOA16/SPI_SOUT', identifier: SPI_SOUT}
- {pin_num: '47', pin_signal: ADCA_CH7e/PTA17/SPI0_SIN/UART0_RTS_b, label: 'J500[B44]/J502[18]/GPIOA17/SPI_SIN', identifier: SPI_SIN}
- {pin_num: '54', pin_signal: ADCB_CH3/PTB1/I2C0_SDA/FTM1_CH1/FTM0_FLT2/EWM_IN/FTM1_QD_PHB/UART0_TX, label: 'J500[B27]/J501[33]/GPIOB1/ADCB_CH3', identifier: ADCB_PHB}
- {pin_num: '62', pin_signal: PTB16/UART0_RX/FTM_CLKIN2/CAN0_TX/EWM_IN/XBARIN5, label: 'J500[B52]/J502[1]/GPIOB16/XBARIN5', identifier: DRV_EN}
- {pin_num: '71', pin_signal: ADCB_CH7b/PTC1/LLWU_P6/SPI0_PCS3/UART1_RTS_b/FTM0_CH0/FlexPWM_A3/XBARIN11, label: 'J500[B38]/J501[26]/GPIOC1/PWM_A3/LED6', identifier: TMR_1}
- {pin_num: '72', pin_signal: ADCB_CH6c/CMP1_IN0/PTC2/SPI0_PCS2/UART1_CTS_b/FTM0_CH1/FlexPWM_B3/XBARIN6, label: 'J500[B37]/J501[28]/GPIOC2/PWM_B3/LED7', identifier: ENC_PH1}
- {pin_num: '77', pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/XBARIN2/CMP0_OUT/FTM0_CH2, label: 'J502[3]/GPIOC5/XBARIN2', identifier: TMR_0}
- {pin_num: '78', pin_signal: CMP2_IN4/CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB0_EXTRG/XBARIN3/UART0_RX/XBAROUT6/I2C0_SCL, label: 'J500[B61]/GC6', identifier: TMR_2}
- {pin_num: '79', pin_signal: CMP3_IN4/CMP0_IN1/PTC7/SPI0_SIN/XBARIN4/UART0_TX/XBAROUT7/I2C0_SDA, label: 'J4[1]/J500[B62]/GC7/SW1', identifier: DRV_OC}
- {pin_num: '80', pin_signal: ADCB_CH7c/CMP0_IN2/PTC8/FTM3_CH4, label: 'J500[A34]/J501[13]/GPIOC8/FTM3_CH4', identifier: HALL_0}
- {pin_num: '82', pin_signal: ADCB_CH7d/PTC10/FTM3_CH6, label: 'J501[17]/GPIOC10/FTM3_CH6', identifier: HALL_1}
- {pin_num: '83', pin_signal: ADCB_CH6e/PTC11/LLWU_P11/FTM3_CH7, label: 'J500[A33]/J501[19]/GPIOC11/FTM3_CH7', identifier: HALL_2}
- {pin_num: '85', pin_signal: PTC13/FTM_CLKIN1, label: 'J503[26]/GC13'}
- {pin_num: '93', pin_signal: PTD0/LLWU_P12/SPI0_PCS0/FTM3_CH0/FTM0_CH0/FlexPWM_A0, label: 'J500[A40]/J501[9]/GPIOD0/PWM_A0/LED0', identifier: PWM_A0}
- {pin_num: '94', pin_signal: ADCA_CH7f/PTD1/SPI0_SCK/FTM3_CH1/FTM0_CH1/FlexPWM_B0, label: 'J500[A39]/J501[11]/GPIOD1/PWM_B0/LED1', identifier: PWM_B0}
- {pin_num: '95', pin_signal: PTD2/LLWU_P13/SPI0_SOUT/FTM3_CH2/FTM0_CH2/FlexPWM_A1/I2C0_SCL, label: 'J500[A38]/J501[30]/GPIOD2/PWM_A1/LED2', identifier: PWM_A1}
- {pin_num: '96', pin_signal: PTD3/SPI0_SIN/FTM3_CH3/FTM0_CH3/FlexPWM_B1/I2C0_SDA, label: 'J500[A37]/J501[32]/GPIOD3/PWM_B1/LED3', identifier: PWM_B1}
- {pin_num: '97', pin_signal: PTD4/LLWU_P14/SPI0_PCS1/UART0_RTS_b/FTM0_CH4/FlexPWM_A2/EWM_IN/SPI0_PCS0, label: 'J500[B40]/J501[34]/GPIOD4/PWM_A2/LED4', identifier: PWM_A2}
- {pin_num: '98', pin_signal: ADCA_CH6g/PTD5/SPI0_PCS2/UART0_CTS_b/UART0_COL_b/FTM0_CH5/FlexPWM_B2/EWM_OUT_b/SPI0_SCK, label: 'J500[B39]/J501[36]/GPIOD5/PWM_B2/LED5',
  identifier: PWM_B2}
- {pin_num: '11', pin_signal: ADCA_CH1/PTE17/LLWU_P19/SPI0_SCK/UART1_RX/FTM_CLKIN1/LPTMR0_ALT3, label: 'J500[A28]/J501[12]/GPIOE17/ADCA_CH1', identifier: ADCA_PHC}
- {pin_num: '12', pin_signal: ADCB_CH0/PTE18/LLWU_P20/SPI0_SOUT/UART1_CTS_b/I2C0_SDA, label: 'J500[B30]/J501[18]/ADCB_CH0', identifier: ADCB_UDCB}
- {pin_num: '13', pin_signal: ADCB_CH1/PTE19/SPI0_SIN/UART1_RTS_b/I2C0_SCL/CMP3_OUT, label: 'J500[B29]/J501[20]/ADCB_CH1', identifier: ADCB_PHA}
- {pin_num: '31', pin_signal: ADCB_CH4/PTE24/CAN1_TX/FTM0_CH0/XBARIN2/I2C0_SCL/EWM_OUT_b/XBAROUT4, label: 'J1[2]/J500[B21]/J501[35]/GPIOE24/ADCB_CH4/THM2JP', identifier: USER_LED}
- {pin_num: '32', pin_signal: ADCB_CH5/PTE25/LLWU_P21/CAN1_RX/FTM0_CH1/XBARIN3/I2C0_SDA/EWM_IN/XBAROUT5, label: 'J1[4]/J500[B22]/J501[37]/GPIOE25/ADCB_CH5/THM2JN',
  identifier: BRAKE_CTRL}
- {pin_num: '19', pin_signal: ADCA_CH3, label: 'J500[A30]/J501[6]', identifier: ADCA_PHA}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "fsl_xbara.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    PinTool_PWM();
    PinTool_ADC();
    PinTool_UART();
    PinTool_OSC();
    PinTool_Misc();
    PinTool_SPI();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

